JUMP_ADDR_0
JUMP_ADDR_1
JUMP_ADDR_2
JUMP_ADDR_3
JUMP_ADDR_4
JUMP_ADDR_5
JUMP_ADDR_6
JUMP_ADDR_7
JUMP_ADDR_8
JUMP_ADDR_9
JUMP_ADDR_10
JUMP_ADDR_11
JUMP_ADDR_12
JUMP_ADDR_13
JUMP_ADDR_14
JUMP_ADDR_15
JUMP_ADDR_16
JUMP_ADDR_17
JUMP_ADDR_18
JUMP_ADDR_19
JUMP_ADDR_20
JUMP_ADDR_21
JUMP_ADDR_22
JUMP_ADDR_23
JUMP_ADDR_24
JUMP_ADDR_25
JUMP_ADDR_26
JUMP_ADDR_27
JUMP_ADDR_28
JUMP_ADDR_29
JUMP_ADDR_30
JUMP_ADDR_31
JUMP_ADDR_32
JUMP_ADDR_33
JUMP_ADDR_34
JUMP_ADDR_35
JUMP_ADDR_36
JUMP_ADDR_37
JUMP_ADDR_38
JUMP_ADDR_39
JUMP_ADDR_40
JUMP_ADDR_41
JUMP_ADDR_42
JUMP_ADDR_43
JUMP_ADDR_44
JUMP_ADDR_45
JUMP_ADDR_46
JUMP_ADDR_47
JUMP_ADDR_48
JUMP_ADDR_49
JUMP_ADDR_50
JUMP_ADDR_51
JUMP_ADDR_52
JUMP_ADDR_53
JUMP_ADDR_54
JUMP_ADDR_55
JUMP_ADDR_56
JUMP_ADDR_57
JUMP_ADDR_58
JUMP_ADDR_59
JUMP_ADDR_60
JUMP_ADDR_61
JUMP_ADDR_62
JUMP_ADDR_63
JUMP_ADDR_64
JUMP_ADDR_65
JUMP_ADDR_66
JUMP_ADDR_67
JUMP_ADDR_68
JUMP_ADDR_69
JUMP_ADDR_70
JUMP_ADDR_71
JUMP_ADDR_72
JUMP_ADDR_73
JUMP_ADDR_74
JUMP_ADDR_75
JUMP_ADDR_76
JUMP_ADDR_77
JUMP_ADDR_78
JUMP_ADDR_79
JUMP_ADDR_80
JUMP_ADDR_81
JUMP_ADDR_82
JUMP_ADDR_83
JUMP_ADDR_84
JUMP_ADDR_85
JUMP_ADDR_86
JUMP_ADDR_87
JUMP_ADDR_88
JUMP_ADDR_89
JUMP_ADDR_90
JUMP_ADDR_91
JUMP_ADDR_92
JUMP_ADDR_93
JUMP_ADDR_94
JUMP_ADDR_95
JUMP_ADDR_96
JUMP_ADDR_97
JUMP_ADDR_98
JUMP_ADDR_99
JUMP_ADDR_100
JUMP_ADDR_101
JUMP_ADDR_102
JUMP_ADDR_103
JUMP_ADDR_104
JUMP_ADDR_105
JUMP_ADDR_106
JUMP_ADDR_107
JUMP_ADDR_108
JUMP_ADDR_109
JUMP_ADDR_110
JUMP_ADDR_111
JUMP_ADDR_112
JUMP_ADDR_113
JUMP_ADDR_114
JUMP_ADDR_115
JUMP_ADDR_116
JUMP_ADDR_117
JUMP_ADDR_118
JUMP_ADDR_119
JUMP_ADDR_120
JUMP_ADDR_121
JUMP_ADDR_122
JUMP_ADDR_123
JUMP_ADDR_124
JUMP_ADDR_125
JUMP_ADDR_126
JUMP_ADDR_127
JUMP_ADDR_128
JUMP_ADDR_129
JUMP_ADDR_130
JUMP_ADDR_131
JUMP_ADDR_132
JUMP_ADDR_133
JUMP_ADDR_134
JUMP_ADDR_135
JUMP_ADDR_136
JUMP_ADDR_137
JUMP_ADDR_138
JUMP_ADDR_139
JUMP_ADDR_140
JUMP_ADDR_141
JUMP_ADDR_142
JUMP_ADDR_143
JUMP_ADDR_144
JUMP_ADDR_145
JUMP_ADDR_146
JUMP_ADDR_147
JUMP_ADDR_148
JUMP_ADDR_149
JUMP_ADDR_150
JUMP_ADDR_151
JUMP_ADDR_152
JUMP_ADDR_153
JUMP_ADDR_154
JUMP_ADDR_155
JUMP_ADDR_156
JUMP_ADDR_157
JUMP_ADDR_158
JUMP_ADDR_159
JUMP_ADDR_160
JUMP_ADDR_161
JUMP_ADDR_162
JUMP_ADDR_163
JUMP_ADDR_164
JUMP_ADDR_165
JUMP_ADDR_166
JUMP_ADDR_167
JUMP_ADDR_168
JUMP_ADDR_169
JUMP_ADDR_170
JUMP_ADDR_171
JUMP_ADDR_172
JUMP_ADDR_173
JUMP_ADDR_174
JUMP_ADDR_175
JUMP_ADDR_176
JUMP_ADDR_177
JUMP_ADDR_178
JUMP_ADDR_179
JUMP_ADDR_180
JUMP_ADDR_181
JUMP_ADDR_182
JUMP_ADDR_183
JUMP_ADDR_184
JUMP_ADDR_185
JUMP_ADDR_186
JUMP_ADDR_187
JUMP_ADDR_188
JUMP_ADDR_189
JUMP_ADDR_190
JUMP_ADDR_191
JUMP_ADDR_192
JUMP_ADDR_193
JUMP_ADDR_194
JUMP_ADDR_195
JUMP_ADDR_196
JUMP_ADDR_197
JUMP_ADDR_198
JUMP_ADDR_199
JUMP_ADDR_200
JUMP_ADDR_201
JUMP_ADDR_202
JUMP_ADDR_203
JUMP_ADDR_204
JUMP_ADDR_205
JUMP_ADDR_206
JUMP_ADDR_207
JUMP_ADDR_208
JUMP_ADDR_209
JUMP_ADDR_210
JUMP_ADDR_211
JUMP_ADDR_212
JUMP_ADDR_213
JUMP_ADDR_214
JUMP_ADDR_215
JUMP_ADDR_216
JUMP_ADDR_217
JUMP_ADDR_218
JUMP_ADDR_219
JUMP_ADDR_220
JUMP_ADDR_221
JUMP_ADDR_222
JUMP_ADDR_223
JUMP_ADDR_224
JUMP_ADDR_225
JUMP_ADDR_226
JUMP_ADDR_227
JUMP_ADDR_228
JUMP_ADDR_229
JUMP_ADDR_230
JUMP_ADDR_231
JUMP_ADDR_232
JUMP_ADDR_233
JUMP_ADDR_234
JUMP_ADDR_235
JUMP_ADDR_236
JUMP_ADDR_237
JUMP_ADDR_238
JUMP_ADDR_239
JUMP_ADDR_240
JUMP_ADDR_241
JUMP_ADDR_242
JUMP_ADDR_243
JUMP_ADDR_244
JUMP_ADDR_245
JUMP_ADDR_246
JUMP_ADDR_247
JUMP_ADDR_248
JUMP_ADDR_249
JUMP_ADDR_250
JUMP_ADDR_251
JUMP_ADDR_252
JUMP_ADDR_253
JUMP_ADDR_254
JUMP_ADDR_255
JUMP_ADDR_256
JUMP_ADDR_257
JUMP_ADDR_258
JUMP_ADDR_259
JUMP_ADDR_260
JUMP_ADDR_261
JUMP_ADDR_262
JUMP_ADDR_263
JUMP_ADDR_264
JUMP_ADDR_265
JUMP_ADDR_266
JUMP_ADDR_267
JUMP_ADDR_268
JUMP_ADDR_269
JUMP_ADDR_270
JUMP_ADDR_271
JUMP_ADDR_272
JUMP_ADDR_273
JUMP_ADDR_274
JUMP_ADDR_275
JUMP_ADDR_276
JUMP_ADDR_277
JUMP_ADDR_278
JUMP_ADDR_279
JUMP_ADDR_280
JUMP_ADDR_281
JUMP_ADDR_282
JUMP_ADDR_283
JUMP_ADDR_284
JUMP_ADDR_285
JUMP_ADDR_286
JUMP_ADDR_287
JUMP_ADDR_288
JUMP_ADDR_289
JUMP_ADDR_290
JUMP_ADDR_291
JUMP_ADDR_292
JUMP_ADDR_293
JUMP_ADDR_294
JUMP_ADDR_295
JUMP_ADDR_296
JUMP_ADDR_297
JUMP_ADDR_298
JUMP_ADDR_299
JUMP_ADDR_300
JUMP_ADDR_301
JUMP_ADDR_302
JUMP_ADDR_303
JUMP_ADDR_304
JUMP_ADDR_305
JUMP_ADDR_306
JUMP_ADDR_307
JUMP_ADDR_308
JUMP_ADDR_309
JUMP_ADDR_310
JUMP_ADDR_311
JUMP_ADDR_312
JUMP_ADDR_313
JUMP_ADDR_314
JUMP_ADDR_315
JUMP_ADDR_316
JUMP_ADDR_317
JUMP_ADDR_318
JUMP_ADDR_319
JUMP_ADDR_320
JUMP_ADDR_321
JUMP_ADDR_322
JUMP_ADDR_323
JUMP_ADDR_324
JUMP_ADDR_325
JUMP_ADDR_326
JUMP_ADDR_327
JUMP_ADDR_328
JUMP_ADDR_329
JUMP_ADDR_330
JUMP_ADDR_331
JUMP_ADDR_332
JUMP_ADDR_333
JUMP_ADDR_334
JUMP_ADDR_335
JUMP_ADDR_336
JUMP_ADDR_337
JUMP_ADDR_338
JUMP_ADDR_339
JUMP_ADDR_340
JUMP_ADDR_341
JUMP_ADDR_342
JUMP_ADDR_343
JUMP_ADDR_344
JUMP_ADDR_345
JUMP_ADDR_346
JUMP_ADDR_347
JUMP_ADDR_348
JUMP_ADDR_349
JUMP_ADDR_350
JUMP_ADDR_351
JUMP_ADDR_352
JUMP_ADDR_353
JUMP_ADDR_354
JUMP_ADDR_355
JUMP_ADDR_356
JUMP_ADDR_357
JUMP_ADDR_358
JUMP_ADDR_359
JUMP_ADDR_360
JUMP_ADDR_361
JUMP_ADDR_362
JUMP_ADDR_363
JUMP_ADDR_364
JUMP_ADDR_365
JUMP_ADDR_366
JUMP_ADDR_367
JUMP_ADDR_368
JUMP_ADDR_369
JUMP_ADDR_370
JUMP_ADDR_371
JUMP_ADDR_372
JUMP_ADDR_373
JUMP_ADDR_374
JUMP_ADDR_375
JUMP_ADDR_376
JUMP_ADDR_377
JUMP_ADDR_378
JUMP_ADDR_379
JUMP_ADDR_380
JUMP_ADDR_381
JUMP_ADDR_382
JUMP_ADDR_383
JUMP_ADDR_384
JUMP_ADDR_385
JUMP_ADDR_386
JUMP_ADDR_387
JUMP_ADDR_388
JUMP_ADDR_389
JUMP_ADDR_390
JUMP_ADDR_391
JUMP_ADDR_392
JUMP_ADDR_393
JUMP_ADDR_394
JUMP_ADDR_395
JUMP_ADDR_396
JUMP_ADDR_397
JUMP_ADDR_398
JUMP_ADDR_399
JUMP_ADDR_400
JUMP_ADDR_401
JUMP_ADDR_402
JUMP_ADDR_403
JUMP_ADDR_404
JUMP_ADDR_405
JUMP_ADDR_406
JUMP_ADDR_407
JUMP_ADDR_408
JUMP_ADDR_409
JUMP_ADDR_410
JUMP_ADDR_411
JUMP_ADDR_412
JUMP_ADDR_413
JUMP_ADDR_414
JUMP_ADDR_415
JUMP_ADDR_416
JUMP_ADDR_417
JUMP_ADDR_418
JUMP_ADDR_419
JUMP_ADDR_420
JUMP_ADDR_421
JUMP_ADDR_422
JUMP_ADDR_423
JUMP_ADDR_424
JUMP_ADDR_425
JUMP_ADDR_426
JUMP_ADDR_427
JUMP_ADDR_428
JUMP_ADDR_429
JUMP_ADDR_430
JUMP_ADDR_431
JUMP_ADDR_432
JUMP_ADDR_433
JUMP_ADDR_434
JUMP_ADDR_435
JUMP_ADDR_436
JUMP_ADDR_437
JUMP_ADDR_438
JUMP_ADDR_439
JUMP_ADDR_440
JUMP_ADDR_441
JUMP_ADDR_442
JUMP_ADDR_443
JUMP_ADDR_444
JUMP_ADDR_445
JUMP_ADDR_446
JUMP_ADDR_447
JUMP_ADDR_448
JUMP_ADDR_449
JUMP_ADDR_450
JUMP_ADDR_451
JUMP_ADDR_452
JUMP_ADDR_453
JUMP_ADDR_454
JUMP_ADDR_455
JUMP_ADDR_456
JUMP_ADDR_457
JUMP_ADDR_458
JUMP_ADDR_459
JUMP_ADDR_460
JUMP_ADDR_461
JUMP_ADDR_462
JUMP_ADDR_463
JUMP_ADDR_464
JUMP_ADDR_465
JUMP_ADDR_466
JUMP_ADDR_467
JUMP_ADDR_468
JUMP_ADDR_469
JUMP_ADDR_470
JUMP_ADDR_471
JUMP_ADDR_472
JUMP_ADDR_473
JUMP_ADDR_474
JUMP_ADDR_475
JUMP_ADDR_476
JUMP_ADDR_477
JUMP_ADDR_478
JUMP_ADDR_479
JUMP_ADDR_480
JUMP_ADDR_481
JUMP_ADDR_482
JUMP_ADDR_483
JUMP_ADDR_484
JUMP_ADDR_485
JUMP_ADDR_486
JUMP_ADDR_487
JUMP_ADDR_488
JUMP_ADDR_489
JUMP_ADDR_490
JUMP_ADDR_491
JUMP_ADDR_492
JUMP_ADDR_493
JUMP_ADDR_494
JUMP_ADDR_495
JUMP_ADDR_496
JUMP_ADDR_497
JUMP_ADDR_498
JUMP_ADDR_499
JUMP_ADDR_500
JUMP_ADDR_501
JUMP_ADDR_502
JUMP_ADDR_503
JUMP_ADDR_504
JUMP_ADDR_505
JUMP_ADDR_506
JUMP_ADDR_507
JUMP_ADDR_508
JUMP_ADDR_509
JUMP_ADDR_510
JUMP_ADDR_511
!
#-0x1
#-0x10
#-0x2
#-0x2^10
#-0x2^11
#-0x2^12
#-0x2^15
#-0x2^16
#-0x2^18
#-0x2^1d
#-0x2^1e
#-0x2^1f
#-0x2^20
#-0x2^21
#-0x2^27
#-0x2^28
#-0x2^29
#-0x2^2b
#-0x2^2c
#-0x2^2e
#-0x2^2f
#-0x2^33
#-0x2^34
#-0x2^35
#-0x2^36
#-0x2^39
#-0x2^3a
#-0x2^3b
#-0x2^3d
#-0x2^3e
#-0x2^3f
#-0x2^4
#-0x2^5
#-0x2^6
#-0x2^7
#-0x2^8
#-0x2^9
#-0x2^a
#-0x2^b
#-0x2^c
#-0x2^d
#-0x2^e
#-0x2^f
#-0x3
#-0x4
#-0x5
#-0x6
#-0x7
#-0x8
#-0x9
#-0xa
#-0xb
#-0xc
#-0xd
#-0xe
#-0xf
#0
#0.0
#0x0
#0x1
#0x10
#0x2
#0x2^10
#0x2^11
#0x2^12
#0x2^13
#0x2^14
#0x2^15
#0x2^16
#0x2^17
#0x2^18
#0x2^19
#0x2^1a
#0x2^1b
#0x2^1c
#0x2^1d
#0x2^1e
#0x2^1f
#0x2^20
#0x2^21
#0x2^22
#0x2^23
#0x2^24
#0x2^25
#0x2^26
#0x2^27
#0x2^28
#0x2^29
#0x2^2a
#0x2^2b
#0x2^2c
#0x2^2d
#0x2^2e
#0x2^2f
#0x2^30
#0x2^31
#0x2^32
#0x2^33
#0x2^34
#0x2^35
#0x2^36
#0x2^37
#0x2^38
#0x2^39
#0x2^3a
#0x2^3b
#0x2^3c
#0x2^3d
#0x2^3e
#0x2^3f
#0x2^4
#0x2^5
#0x2^6
#0x2^7
#0x2^8
#0x2^9
#0x2^a
#0x2^b
#0x2^c
#0x2^d
#0x2^e
#0x2^f
#0x3
#0x4
#0x5
#0x6
#0x7
#0x8
#0x9
#0xa
#0xb
#0xc
#0xd
#0xe
#0xf
#1
#12
#16
#2
#24
#3
#32
#48
#8
(
)
*
+
-0x2^0
-0x2^1
-0x2^10
-0x2^11
-0x2^12
-0x2^13
-0x2^14
-0x2^15
-0x2^16
-0x2^17
-0x2^18
-0x2^19
-0x2^1b
-0x2^1c
-0x2^1d
-0x2^1e
-0x2^1f
-0x2^2
-0x2^20
-0x2^21
-0x2^22
-0x2^23
-0x2^24
-0x2^25
-0x2^26
-0x2^27
-0x2^28
-0x2^2b
-0x2^2c
-0x2^2d
-0x2^2f
-0x2^3
-0x2^30
-0x2^31
-0x2^32
-0x2^33
-0x2^35
-0x2^36
-0x2^37
-0x2^38
-0x2^39
-0x2^3a
-0x2^3b
-0x2^3c
-0x2^3d
-0x2^3e
-0x2^3f
-0x2^4
-0x2^5
-0x2^6
-0x2^7
-0x2^8
-0x2^9
-0x2^a
-0x2^b
-0x2^c
-0x2^d
-0x2^e
-0x2^f
0x2^0
0x2^1
0x2^10
0x2^11
0x2^12
0x2^13
0x2^14
0x2^15
0x2^16
0x2^17
0x2^18
0x2^19
0x2^1a
0x2^1b
0x2^1c
0x2^1d
0x2^1e
0x2^1f
0x2^2
0x2^20
0x2^21
0x2^22
0x2^23
0x2^24
0x2^25
0x2^26
0x2^27
0x2^28
0x2^29
0x2^2a
0x2^2b
0x2^2c
0x2^2d
0x2^2e
0x2^2f
0x2^3
0x2^30
0x2^31
0x2^32
0x2^33
0x2^34
0x2^35
0x2^36
0x2^37
0x2^38
0x2^39
0x2^3a
0x2^3b
0x2^3c
0x2^3d
0x2^3e
0x2^3f
0x2^4
0x2^5
0x2^6
0x2^7
0x2^8
0x2^9
0x2^a
0x2^b
0x2^c
0x2^d
0x2^e
0x2^f
1
2
3
4
5
6
7
JUMP_ADDR_EXCEEDED
UNK_JUMP_ADDR
[
]
a0
a1
a2
a3
a4
a5
a6
a7
adc
add
add.lock
addi
addiw
addp
addpd
adds
addsd
addss
addv
addw
adr
adrp
ah
al
and
andi
andnpd
andnps
andpd
andps
ands
asr
auipc
autiasp
ax
b
b.cc
b.cs
b.eq
b.ge
b.gt
b.hi
b.le
b.ls
b.lt
b.mi
b.ne
b.pl
b.vc
b.vs
b15
b29
b30
b31
beq
bfm
bfxil
bge
bgeu
bh
bic
bics
bif
bl
blr
blt
bltu
bne
bp
bpl
br
brk
bsf
bsl
bsr
bswap
bt
btc
bti
btr
bts
bx
byte_ptr
c
c.add
c.addi
c.addi16sp
c.addi4spn
c.addiw
c.addw
c.and
c.andi
c.beqz
c.bnez
c.ebreak
c.fld
c.fldsp
c.fsd
c.fsdsp
c.j
c.jalr
c.jr
c.ld
c.ldsp
c.li
c.lui
c.lw
c.lwsp
c.mv
c.nop
c.or
c.sd
c.sdsp
c.slli
c.srai
c.srli
c.sub
c.subw
c.sw
c.swsp
c.xor
call
casa
casal
casalb
cbnz
cbw
cbz
cc
ccmn
ccmp
cdq
cdqe
ch
cinc
cinv
cl
cld
clz
cmeq
cmge
cmgt
cmhi
cmhs
cmlt
cmn
cmova
cmovbe
cmovc
cmovg
cmovge
cmovl
cmovle
cmovnc
cmovns
cmovnz
cmovo
cmovs
cmovz
cmp
cmpltps
cmpltsd
cmpltss
cmpnlesd
cmpnless
cmpsb
cmpsw.repe
cmpxchg.lock
cmtst
cneg
cnt
comisd
comiss
cpuid
cqo
crc32
cs
csel
cset
csetm
csinc
csinv
csneg
cvtsd2ss
cvtsi2sd
cvtsi2ss
cvtss2sd
cvttpd2dq
cvttsd2si
cvttss2si
cwde
cx
d0
d1
d10
d11
d12
d13
d14
d15
d16
d18
d19
d2
d20
d21
d22
d23
d24
d25
d26
d27
d28
d29
d3
d30
d31
d4
d5
d6
dec
dec.lock
dh
di
dil
div
divpd
divps
divsd
divss
divu
divuw
divw
dl
dmb
double
dup
dword_ptr
dx
dyn
eax
ebp
ebx
ecx
edi
edx
endbr32
endbr64
eor
eq
es:edi
esi
esp
ext
extended
extr
fa0
fa1
fa2
fa3
fa4
fa5
fabs
fabs.d
fabs.s
fadd
fadd.d
fadd.s
faddp
fccmpe
fcmgt
fcmovbe
fcmovnbe
fcmp
fcmpe
fcomi
fcomip
fcsel
fcvt
fcvt.d.l
fcvt.d.lu
fcvt.d.s
fcvt.d.w
fcvt.d.wu
fcvt.l.d
fcvt.lu.d
fcvt.s.d
fcvt.s.lu
fcvt.s.w
fcvt.s.wu
fcvt.w.d
fcvt.w.s
fcvt.wu.d
fcvtas
fcvtau
fcvtms
fcvtps
fcvtzs
fcvtzu
fdiv
fdiv.d
fdiv.s
fdivp
fdivr
fdivrp
feq.d
feq.s
fidiv
fidivr
fild
fimul
fist
fistp
fisub
fld
fld1
fldcw
fldz
fle.d
fle.s
float
flt.d
flt.s
flw
fmadd
fmadd.d
fmov
fmul
fmul.d
fmul.s
fmulp
fmv.d
fmv.d.x
fmv.s
fmv.w.x
fmv.x.d
fnmsub
fnstcw
fnstsw
frflags
frinta
frintm
frintp
frndint
fs
fs0
fs1
fs2
fs3
fs4
fs5
fs6
fsd
fsflags
fsgnj.d
fsgnj.s
fst
fstp
fsub
fsub.d
fsub.s
fsubp
fsubr
fsubrp
fsw
fucomi
fucomip
fxam
fxch
ge
gp
gs
gt
h28
h29
h30
h31
hi
hlt
idiv
imul
inc
inc.lock
ish
j
ja
jal
jalr
jbe
jc
jg
jge
jl
jle
jmp
jnc
jno
jnp
jns
jnz
jo
jp
jr
js
jz
lb
lbu
ld
ld1
ld1r
ld2
ld4
ldaddal
ldaddl
ldar
ldarb
ldaxr
ldaxrb
ldp
ldpsw
ldr
ldrb
ldrh
ldrsb
ldrsh
ldrsw
ldset
ldur
ldurb
ldurh
ldursw
ldxr
le
lea
leave
lh
lhu
li
ls
lsl
lsr
lt
lui
lw
lwu
madd
maxsd
maxss
mi
minsd
minss
mov
movapd
movaps
movd
movdqa
movdqu
movhlps
movhpd
movhps
movi
movk
movlpd
movlps
movmskpd
movq
movsb
movsb.rep
movsd
movsd.rep
movsq.rep
movss
movsx
movsxd
movupd
movups
movzx
mrs
msub
mul
mulh
mulhu
mulpd
mulps
mulsd
mulss
mulw
mv
mvn
mvni
ne
neg
negs
negw
ngc
nop
not
or
or.lock
ori
orn
orpd
orps
orr
paciasp
packuswb
paddd
paddq
paddw
palignr
pand
pandn
pause
pblendw
pclmullqhqdq
pclmullqlqdq
pcmpeqb
pcmpeqd
pcmpgtb
pcmpgtd
pextrw
pinsrb
pinsrq
pinsrw
pl
pmovzxdq
pmuludq
pop
por
pshufb
pshufd
pshuflw
pslld
psllq
psllw
psrad
psraw
psrld
psrldq
psrlq
psrlw
psubb
psubd
psubq
psubusw
ptr
punpckhbw
punpckhdq
punpckhqdq
punpckhwd
punpcklbw
punpckldq
punpcklqdq
punpcklwd
push
pxor
q0
q1
q12
q13
q14
q15
q16
q17
q18
q19
q2
q20
q21
q22
q23
q24
q25
q26
q27
q28
q29
q3
q30
q31
q4
q5
q6
q7
qword_ptr
r10
r10b
r10d
r10w
r11
r11b
r11d
r11w
r12
r12b
r12d
r12w
r13
r13b
r13d
r13w
r14
r14b
r14d
r14w
r15
r15b
r15d
r15w
r8
r8b
r8d
r8w
r9
r9b
r9d
r9w
ra
rax
rbit
rbp
rbx
rcx
rdi
rdn
rdx
rem
remu
remuw
remw
ret
rev
rev16
rev32
rev64
rmm
rol
ror
rsi
rsp
rtz
rup
s0
s1
s10
s11
s12
s13
s14
s15
s16
s17
s18
s19
s2
s20
s21
s22
s23
s24
s25
s26
s27
s28
s29
s3
s30
s31
s4
s5
s6
s7
s8
s9
saddw
sar
sb
sbb
sbc
sbfiz
sbfx
scvtf
sd
sdiv
seta
setbe
setc
setg
setge
setl
setle
setnc
setnp
setnz
seto
setp
setz
sext.w
sh
sha256msg1
sha256msg2
sha256rnds2
shl
shld
shr
shrd
shufpd
shufps
si
sil
sll
slli
slliw
sllw
slt
slti
sltiu
sltu
smaddl
smax
smaxv
smin
sminv
smlal
smlal2
smsubl
smulh
smull
sp
sra
srai
sraiw
sraw
srl
srli
srliw
srlw
sshl
sshr
ssra
ssubw
ssubw2
st0
st1
st2
st3
st4
st5
st6
st7
stlr
stlrb
stlxr
stlxrb
stosb.rep
stosd
stosd.rep
stosq.rep
stp
str
strb
strh
stur
sturb
sturh
stxr
sub
subs
subsd
subss
subw
sw
swpalb
swpl
sxtb
sxth
sxtl
sxtl2
sxtw
t0
t1
t2
t3
t4
t5
t6
tbl
tbnz
tbz
test
tpidr_el0
tst
tzcnt
uaddw
uaddw2
ubfiz
ubfx
ucomisd
ucomiss
ucvtf
ud2
udiv
umaddl
umaxp
umlal
umlal2
umov
umsubl
umulh
umull
unpcklpd
unpcklps
uqsub
ushl
ushr
usra
usubl
usubl2
uxtb
uxth
uxtl
uxtl2
uxtw
uzp1
uzp2
v0.16b
v0.2d
v0.2s
v0.4h
v0.4s
v0.8b
v0.8h
v0.d[0x1]
v0.h[0x0]
v0.s[0x3]
v1.16b
v1.2d
v1.2s
v1.4h
v1.4s
v1.8b
v1.8h
v1.s[0x0]
v1.s[0x1]
v10.16b
v10.2s
v11.16b
v11.2s
v12.16b
v12.2d
v12.8b
v13.16b
v13.2d
v13.2s
v14.16b
v14.2d
v14.2s
v15.16b
v15.2d
v15.2s
v15.8b
v15.d[0x1]
v15.h[0x0]
v15.s[0x0]
v15.s[0x1]
v16.16b
v16.2d
v16.4s
v16.8b
v16.d[0x1]
v17.16b
v17.2d
v17.2s
v17.4s
v18.16b
v18.2d
v18.2s
v18.4s
v18.8h
v18.b[0x0]
v19.16b
v19.2d
v19.2s
v19.4s
v19.8h
v19.b[0x0]
v19.d[0x1]
v2.16b
v2.2d
v2.2s
v2.4h
v2.4s
v2.8b
v2.8h
v20.16b
v20.2d
v20.2s
v20.4s
v20.b[0x0]
v21.16b
v21.2d
v21.2s
v21.4s
v21.8h
v21.b[0x0]
v22.16b
v22.2d
v22.2s
v22.4h
v22.4s
v22.8b
v22.8h
v22.b[0x0]
v22.d[0x0]
v23.16b
v23.2d
v23.2s
v23.4h
v23.4s
v23.8b
v23.8h
v23.b[0x0]
v23.d[0x0]
v23.d[0x1]
v23.s[0x0]
v24.16b
v24.2d
v24.2s
v24.4h
v24.4s
v24.8b
v24.8h
v24.b[0x0]
v24.d
v24.d[0x0]
v24.d[0x1]
v25.16b
v25.2d
v25.2s
v25.4h
v25.4s
v25.8b
v25.8h
v25.b[0x0]
v25.d
v25.h[0x0]
v25.s[0x0]
v26.16b
v26.2d
v26.2s
v26.4h
v26.4s
v26.8b
v26.8h
v26.b[0x0]
v26.d[0x0]
v26.d[0x1]
v26.h[0x0]
v26.s[0x0]
v26.s[0x3]
v27.16b
v27.2d
v27.2s
v27.4h
v27.4s
v27.8b
v27.8h
v27.b[0x0]
v27.d
v27.d[0x0]
v27.h[0x0]
v27.s
v27.s[0x0]
v27.s[0x3]
v28.16b
v28.2d
v28.2s
v28.4h
v28.4s
v28.8b
v28.8h
v28.b[0x0]
v28.b[0x1]
v28.b[0x2]
v28.b[0x3]
v28.b[0x4]
v28.b[0x5]
v28.b[0x6]
v28.b[0x7]
v28.d[0x0]
v28.d[0x1]
v28.h[0x0]
v28.s[0x0]
v28.s[0x1]
v28.s[0x3]
v29.16b
v29.2d
v29.2s
v29.4h
v29.4s
v29.8b
v29.8h
v29.b[0x0]
v29.b[0x1]
v29.b[0x2]
v29.b[0x3]
v29.b[0x4]
v29.b[0x5]
v29.b[0x6]
v29.b[0x7]
v29.d[0x0]
v29.d[0x1]
v29.h[0x0]
v29.s
v29.s[0x0]
v29.s[0x1]
v29.s[0x3]
v3.16b
v3.2d
v3.2s
v3.4h
v3.4s
v3.8b
v30.16b
v30.2d
v30.2s
v30.4h
v30.4s
v30.8b
v30.8h
v30.b[0x0]
v30.b[0x1]
v30.b[0x2]
v30.b[0x3]
v30.b[0x4]
v30.b[0x5]
v30.b[0x6]
v30.b[0x7]
v30.d
v30.d[0x0]
v30.d[0x1]
v30.h[0x0]
v30.h[0x1]
v30.h[0x2]
v30.h[0x3]
v30.s
v30.s[0x0]
v30.s[0x1]
v30.s[0x3]
v31.16b
v31.2d
v31.2s
v31.4h
v31.4s
v31.8b
v31.8h
v31.b
v31.b[0x0]
v31.b[0x1]
v31.b[0x2]
v31.b[0x3]
v31.b[0x4]
v31.b[0x5]
v31.b[0x6]
v31.b[0x7]
v31.d
v31.d[0x0]
v31.d[0x1]
v31.h
v31.h[0x0]
v31.h[0x1]
v31.h[0x2]
v31.h[0x3]
v31.s
v31.s[0x0]
v31.s[0x1]
v31.s[0x3]
v4.16b
v4.2d
v4.2s
v4.4h
v4.4s
v4.d[0x1]
v5.16b
v5.2d
v5.2s
v5.4h
v5.d[0x1]
v6.16b
v6.2d
v6.2s
v6.4h
v6.4s
v6.8b
v7.16b
v7.2d
v7.2s
v7.4h
v7.4s
vbroadcasti128
vc
vinserti128
vmovd
vmovdqa
vmovdqu
vmovq
vpaddq
vpalignr
vpblendd
vpermq
vpinsrb
vpinsrq
vpor
vpshufb
vpshufd
vpsrlq
vpunpckhqdq
vpunpckldq
vpunpcklqdq
vpunpcklwd
vpxor
vs
w0
w1
w10
w11
w12
w13
w14
w15
w16
w17
w18
w19
w2
w20
w21
w22
w23
w24
w25
w26
w27
w28
w3
w30
w4
w5
w6
w7
w8
w9
word_ptr
wzr
x0
x1
x10
x11
x12
x13
x14
x15
x16
x17
x18
x19
x2
x20
x21
x22
x23
x24
x25
x26
x27
x28
x29
x3
x30
x4
x5
x6
x7
x8
x9
xadd.lock
xchg
xgetbv
xmm0
xmm1
xmm10
xmm11
xmm12
xmm13
xmm14
xmm15
xmm2
xmm3
xmm4
xmm5
xmm6
xmm7
xmm8
xmm9
xmmword_ptr
xor
xori
xorps
xpaclri
xtn
xzr
ymm0
ymm1
ymm10
ymm11
ymm12
ymm13
ymm14
ymm15
ymm2
ymm3
ymm4
ymm5
ymm6
ymm7
ymm8
ymm9
ymmword_ptr
zero
zip1
zip2
{
}
